Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་མུ་སྟེགས་པ་གཞན་ཀུན་ཏུ་རྒྱུ་རྣམས་ཀྱིས་རུས་བུ་བླང་ཞེས་བྱས་ནས་རུས་བུ་མ་མཐོང་ངོ་། །
en: The extremists said, “We’ll take up his relics!” but they couldn’t see the relics,

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་རུས་བུ་དེ་དག་བླངས་ཏེ། རུས་བུ་མཆོད་རྟེན་གྱི་ནང་དུ་བཞག་ནས་བདུག་པ་དང་། ཕྱེ་མ་དང་། མེ་ཏོག་རྣམས་ཀྱིས་བཀུར་སྟི་བྱས་ཏེ་དོང་ངོ་།། །།
en: so the monks collected the relics, placed them in a stūpa, and venerated it with incense, incense powders and cones, and flowers.

source: བཙུན་པ་ཚེ་དང་ལྡན་པ་རབ་བཟང་འདི་ཀུན་གྱི་འོག་ཏུ་རབ་ཏུ་བྱུང་ལ་ཐོག་མ་ཁོ་ནར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེ
en: “tell us why Venerable Subhadra, after going forth last of all, was first to pass into parinirvāṇa,

source: དེའི་འོག་ཏུ་གདོད་བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་ལ་གཟིགས།
en: and how the Blessed One will now pass into parinirvāṇa after him.”

source: གསོལ་པ། བཙུན་པ་འདིས་སྨོན་ལམ་གང་དུ་བཏབ་ལགས།
en: “Lord, where did he make these prayers?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་རྒྱལ་པོ་ཀྲྀ་ཀཱི་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ
en: “Monks,” recounted the Blessed One, “in times past, in this fortunate eon, when people lived as long as twenty thousand years, King Kṛkī reigned in the city of Vārāṇasī.

source: དེའི་ཚེ་རྒྱལ་པོ་ཀྲྀ་ཀཱིའི་མདུན་ན་འདོན་གྱི་བུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ། མདོག་བཟང་བ་གསེར་གྱི་མདོག་ཅན། མགོ་བོ་གདུགས་ལྟར་འདུག་པ། ལག་པ་རིང་བ། དཔྲལ་བའི་དབྱེས་ཆེ་བ། སྣ་མཐོ་བ། སྣ་ལེགས་པ། སྨིན་མ་སྟུག་པ། ལུས་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་པ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་མཛེས་པར་བྱས་པ་ཞིག་བཙས་ཏེ
en: At that time King Kṛkī’s magistrate had a child who was well proportioned, pleasing to the eye, and beautiful, with glowing, golden skin and a well-rounded head, long arms, a broad brow, a fine and prominent nose, and eyebrows that met, graced with the thirty-two signs of great persons, and embellished by the eighty minor marks of perfection.

source: ཁྱེའུ་འདིའི་རུས་འོད་སྲུང་ཡིན་པས་ན་ཁྱེའུ་འདིའི་མིང་འོད་སྲུང་ཉིད་དུ་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: And they named him, saying, ‘Since this is a child of the Kāśyapa clan, his name will likewise be Kāśyapa.’

source: དེ་ནས་ཁྱེའུ་འོད་སྲུང་འོ་མ་དང་། ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ནས།
en: “They reared young Kāśyapa on milk, yogurt, butter, ghee, and milk solids, and when he had grown, the soothsayers and augurs made this prediction:

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་མཚན་མཁན་བྱེ་བྲག་ཕྱེད་པ་དག་གིས་ལུང་བསྟན་པ། ཁྱེའུ་འོད་སྲུང་འདི་གལ་ཏེ་རབ་ཏུ་མ་བྱུང་ན་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་རོ། །
en: ‘If young Kāśyapa does not go forth, he will become a universal monarch,

source: གལ་ཏེ་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་ཆོས་གོས་ཚོན་ཅན་གྱོན་ཏེ་ཡང་དག་པའི་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ན་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་ཏེའཇིག་རྟེན་དུ་གྲགས་པ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་རོ་ཞེས་ཟེར་རོ། །
en: but if he shaves his head and face and dons the colorful religious robes, and if with nothing short of perfect faith he goes forth from home to live as a mendicant, then he will be renowned throughout the world as a tathāgata, an arhat, a totally and completely awakened buddha.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འོད་སྲུང་གི་མཛའ་བོ་བཤེས་པ་བྲམ་ཟེའི་ཁྱེའུ་མྱ་ངན་མེད་ཅེས་བྱ་བ་ཞིག་ཡོད་པ་དེས་དེ
en: “Bodhisattva Kāśyapa’s best friend was a young brahmin named Aśoka.

source: འི་ལུང་བསྟན་པ་དེ་ཐོས་ནས་དེ་ཐོས་མ་ཐག་ཏུ་སྨྲས་པ།
en: When he heard the prophecy he said,

source: གྲོགས་པོ་ཤེས་པར་གྱིས་ལ་ང་དང་མ་འགྲོགས་པར་ཁྱེད་དཀའ་ཐུབ་ཀྱི་ཚལ་དུ་མ་འགྲོ་ཤིག་ཅེས་བྱས་སོ། །
en: ‘My friend, do not end our friendship to go live in a forest for practicing austerities.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མྱ་ངན་ལས་འདའ་བ་ལ་དགོངས་ནས་ང་ཁྱོད་དང་མ་འགྲོགས་ཀྱི་བར་དུ་མི་འགྲོའོ་ཞེས་བྱས་སོ། །
en: The Bodhisattva, in reference to his passing into nirvāṇa, said, ‘As long as we are friends, I shall not go.’

source: དེ་ནས་དེར་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་འོད་སྲུང་གིས་རྒན་པོ་དང་། ནད་པ་དང་ཤི་བ་གཟིགས་ནས་ནགས་ཚལ་གྱི་ནང་དུ་གཤེགས་པ་དེའི་ཚེ་མྱ་ངན་མེད་མི་དགའ་བར་གྱུར་ཏེ
en: So Aśoka was very unhappy when Bodhisattva Kāśyapa went to live in the forest after witnessing old age, sickness, and death and thought,

source: དེས་ཇི་ལྟར་དམ་བཅས་པ་བཞིན་དུ་མ་བྱས་སོ་སྙམ་མོ། །
en: ‘He didn’t do as he promised.’

source: དེ་ནས་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་འོད་སྲུང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་བཱ་རཱ་ཎ་སཱིར་གཤེགས་པ་དེའི་ཚེ། དེས་དེར་ལན་གསུམ་དུ་བཟླས་ཏེ་ཆོས་ཀྱི་འཁོར་ལོ་རྣམ་པ་བཅུ་གཉིས་ཆོས་བཞིན་དུ་བསྐོར་ནས་དེ་རྒྱལ་པོ་ཀྲྀ་ཀཱིས་བཤོས་ལ་སྤྱན་དྲངས་ཏེ།
en: “After Bodhisattva Kāśyapa achieved unexcelled, total, and complete enlightenment and traveled to Vārāṇasī, where he thrice turned the Dharma wheel in its twelve aspects, he was invited for food by King Kṛkī.

source: རྒྱལ་པོས་དེ་ཁོ་ནའི་མཚན་མོ་ལམ་ཡང་མཛེས་པར་བྱེད་དུ་བཅུག །དེ་ཁོ་ནའི་མཚན་མོ་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་རྣམས་ཀྱང་སྦྱར་ཏེ་གདན་བཤམས་ནས་ཆུ་ར་བཀང་སྟེ།
en: That night the king arranged for the road to be beautified and prepared many good, wholesome foods. In the morning he rose, prepared seats, and filled the water pots.

source: བཅོམ་ལྡན་འདས་ལ་ཕྲིན་གྱིས་གདུགས་ཚོད་བསྐུལ་ནས་རྒྱལ་པོ་དེ་ཉིད་ཀྱིས་བདུག་པ་དང་།
en: Then the king sent a message to the Blessed One reminding him of the time, and,

source: ཕྱེ་མ་དང་སྤོས་དང་མེ་ཏོག་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཁྱེར་ཏེ། སིལ་སྙན་གྱི་སྒྲ་ཆེན་པོ་སྒྲོགས་ཤིང་དྲང་སྲོང་སྨྲ་བ་ནས་
en: bearing burning sticks of incense, incense powders, and incense cones, flowers, parasols, banners, and flags, amid a crashing of cymbals, he set out from Ṛṣivadana.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་བསུ་ནས་འབྱོར་པ་ཆེན་པོས་བཱ་རཱ་ཎ་སཱིར་སྤྱན་དྲངས་སོ། །
en: He greeted the totally and completely awakened Buddha Kāśyapa with great opulence and invited him to Vārāṇasī.

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་མྱ་ངན་མེད་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་འོད་སྲུང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་བཱ་རཱ་ཎ་སཱིར་གཤེགས་ཏེ། དེ་རྒྱལ་པོ་ཀྲྀ་ཀཱིས་བཤོས་ལ་སྤྱན་དྲངས་ནས་
en: “The young brahmin Aśoka heard that Bodhisattva Kāśyapa had achieved unexcelled, total, and complete enlightenment. He heard that the Bodhisattva had traveled to Vārāṇasī where he was invited for food by King Kṛkī,

source: རྒྱལ་པོ་དེས་དེ་ཁོ་ནའི་མཚན་མོ་ལམ་ཡང་མཛེས་པར་བྱེད་དུ་བཅུག །དེ་ཁོ་ནའི་མཚན་མོ་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་རྣམས་ཀྱང་སྦྱར་ཏེ་གདན་བཤམས་ནས་ཆུ་ར་བཀང་སྟེ།
en: and that King Kṛkī had arranged for the road to be beautified, had prepared many good, wholesome foods that night, and then had risen in the morning, prepared seats, and filled the water pots.

source: བཅོམ་ལྡན་འདས་ལ་ཕྲིན་གྱིས་གདུགས་ཚོད་བསྐུལ་ནས་རྒྱལ་པོ་དེ་ཉིད་ཀྱིས་བདུག་པ་དང་། ཕྱེ་མ་དང་། སྤོས་དང་། མེ་ཏོག་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཁྱེར་ཏེསིལ་སྙན་གྱི་སྒྲ་ཆེན་པོ་སྒྲོགས་ཤིང་དྲང་སྲོང་སྨྲ་བ་ནས་
en: He heard that the king had sent the Blessed One a message reminding him of the time; that he had borne burning sticks of incense, incense powders, and incense cones, parasols, banners, and flags, amid a crashing of cymbals; that he had set out from Ṛṣivadana;

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་བསུ་ནས་འབྱོར་པ་ཆེན་པོས་བཱ་རཱ་ཎ་སཱིར་སྤྱན་དྲངས་སོ་ཞེས་ཐོས་སོ། །
en: and that he had greeted the totally and completely awakened Buddha Kāśyapa with great opulence and invited him to Vārāṇasī.

source: ཐོས་ནས་ཀྱང་སྔོན་གྱི་མི་དགའ་བར་གྱུར་པས་ཐག་མི་རིང་བ་ཞིག་ཏུ་འདུག་སྟེ་ལྟ་བར་བྱེད་ལ་དྲུང་དུ་ལྟར་འགྲོར་མི་འདོད་དོ། །
en: After hearing all this, because he was so upset before, he sat at a distance and looked on, not wishing to approach.

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་དགོངས་ནས། ཕྱག་གླང་པོ་ཆེའི་སྣ་ལྟ་བུ་བརྐྱང་སྟེ་ཕྱག་གིས་བཟུང་ནས་དྲངས་ཏེ་བཀའ་སྩལ་པ།
en: “The totally and completely awakened Buddha focused his mind and, extending his arm like an elephant’s trunk, grasped him and drew him near, saying,

source: མྱ་ངན་མེད་ཁྱོད་ཅིའི་ཕྱིར་ང་དང་ཕྲད་དུ་འོང་བར་མི་འདོད།
en: ‘Aśoka, why don’t you wish to come meet me?’

source: དེས་གསོལ་པ། སྔོན་བདག་ལ་དམ་བཞེས་པ་ནི་ང་གང་དུ་འགྲོ་བ་དེར་ཁྱོད་ཁྲིད་དེ་
en: “ ‘You promised that wherever you went, you would bring me with you,’ he replied.

source: འགྲོའོ་ཞེས་ཁྱོད་ཀྱིས་དམ་བཅས་པ་ལས་གཅིག་པུ་དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དུ་བཞུད་དེ།
en: ‘But even after your promise, you departed alone for a forest devoted to austerities.

source: སྔོན་བདག་མི་དགའ་བའི་གཞི་མཆིས་པའི་སླད་དུ་མཆི་མི་འཚལ་ལོ། །
en: I didn’t come because I was so upset before.’

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བཀའ་སྩལ་པ།
en: “The totally and completely awakened Buddha Kāśyapa explained,

source: ངས་ནི་མྱ་ངན་ལས་འདའ་བ་ལས་བསམས་ཏེ་སྨྲས་པ་ཡིན་ན།
en: ‘It was in reference to my passing into nirvāṇa that I spoke thus.

source: ཡོང་ཡང་ཁྱོད་དེར་ཕྱིན་དུ་ཟིན་ན་ཅི་ལ་ཕན་ཏེ་ད་ནི་དམ་བཅས་པ་དེའི་དུས་ལ་བབ་བོ། །མྱ་ངན་མེད་ཀྱིས་གསོལ་པ།
en: Now the time has come to keep my promise. What use would it have been if you had already gone to nirvāṇa?’

source: བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་། བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན
en: “ ‘Lord,’ Aśoka said, ‘if permitted I wish to go forth in the Dharma and Vinaya so well spoken, complete my novitiate, and achieve full ordination.

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་ཕྱུང་སྟེ་བསྙེན་པར་རྫོགས་པར་མཛད་ནས་དེ་ལ་ལུང་ཡང་ཕོག་སྟེ།
en: “With the words ‘Come, join me, monk!’ the totally and completely awakened Buddha Kāśyapa led him to go forth as a novice, conferred on him full ordination, and instructed him.

source: དེས་ལུང་དེ་མནོས་པའི་འོག་ཏུ་ལེ་ལོ་བྱེད་ཅིང་འདུག་པ་ལས་
en: But as he pondered the instructions, he became lazy, and merely lay about.

source: དེར་གང་གི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་དགོན་པའི་བསྔགས་པ་བསྟན་པ་དེའི་ཚེ། དེས་ཡིད་ལ་བྱ་བ་མནོས་ནས་དགོན་པའི་གནས་ཤིག་ཏུ་སོང་སྟེ
en: Then, when the totally and completely awakened Buddha Kāśyapa spoke in praise of solitude, he took it to heart and went into solitude.

source: འདུག་པ་ལས་གང་གི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་ཐམས་ཅད་མཛད་ནས་གཟིམས་མལ་གྱི་ཐ་མར་ཞུགས་པ་དེའི་ཚེ་ལྷ་རྣམས་ཀྱིས་ཀུན་ཏུ་སྒྲ་བསྒྲགས་ཏེ།
en: “While he was staying there, the totally and completely awakened Buddha Kāśyapa carried out all the activities of a buddha and took to his final bed. Thereupon the gods proclaimed to all,

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དོ་ནུབ་ནམ་ཕྱེད་ནས་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ་ཞེས་སྒྲ་བསྒྲགས་སོ། །
en: ‘This very night, in the middle of the night, the totally and completely awakened Buddha Kāśyapa will pass beyond all sorrow into the realm of nirvāṇa without any remainder of the aggregates.’

source: དེ་ནས་དགེ་སློང་མྱ་ངན་མེད་ཀྱིས་ལྷ་ནམ་མཁའ་ལ་འགྲོ་བ་དེ་དག་གི་སྒྲ་ཐོས་སོ། །
en: “The monk Aśoka heard what the gods said as they flew through the sky,

source: ཐོས་ནས་ཀྱང་དེ་སྡུག་བསྔལ་ཆེན་པོ་སྐྱེས་ཏེ།
en: and became very upset.

source: བཅོམ་ལྡན་འདས་ནི་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ལ། བདག་གིས་ནི་ཁྱད་པར་ཅི་ཡང་མ་ཐོབ་བོ་སྙམ་ནས་
en: ‘Now the Blessed One will pass into nirvāṇa,’ he thought, ‘and I have not achieved anything of significance.’

source: དེ་གཞི་དེ་ལས་ཤིན་ཏུ་མྱ་ངན་བྱེད་ཅིང་སྡུག་བསྔལ་ལ་སྨྲེ་སྔགས་འདོན་པར་བྱེད་དོ། །
en: He began to grieve and suffer greatly, wailing and lamenting.

source: དེ་ནས་དེ་ལ་དགའ་བའི་ལྷས་དེ་མཐོང་ནས་སྨྲས་པ།
en: “A god who was fond of him saw him and asked,

source: མྱ་ངན་མེད་ཅིའི་ཕྱིར་ཁྱོད་ཤིན་ཏུ་མྱ་ངན་བྱེད་ཅིང་སྡུག་བསྔལ་ལ་སྨྲེ་སྔགས་འདོན་པར་བྱེད།
en: ‘O Aśoka, why do you grieve and suffer so, wailing and lamenting?

source: གལ་ཏེ་ཁྱོད་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་མཐོང་ན་དེ་ལ་བྱ་བ་ཅི་ཞིག་ཡོད།
en: What would you do if you could go see the totally and completely awakened Buddha Kāśyapa?’

source: མྱ་ངན་མེད་ཀྱིས་སྨྲས་པ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་བྱ་བ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་བྱའོ། །
en: “ ‘Whatever the totally and completely awakened Buddha Kāśyapa has said in his teachings should be done. I would do it all,’ Aśoka replied.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ལྷ་དེས་ཁྱེར་ཏེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་སྤྱན་སྔར་བབ་པར་བཞག་ནས།
en: “No sooner had the god heard this than he picked him up and set him down right in front of the totally and completely awakened Buddha Kāśyapa.

source: དེས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: Aśoka approached the totally and completely awakened Buddha Kāśyapa, and upon his arrival he touched his head to his feet and took a seat at one side.

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: Then the Blessed One taught him the Dharma particularly suited to him,

source: དེས་ན་མྱ་ངན་མེད་ཀྱིས་སྟན་དེ་ལ་འདུག་བཞིན་དུ་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: and when he heard it, he cast away all afflictive emotions and manifested arhatship right where he sat.

source: དེ་ནས་མྱ་ངན་མེད་ཀྱིས་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་ནས་འདི་སྙམ་དུ་མ་ལ་
en: “Upon achieving arhatship, Aśoka thought,

source: བདག་སྔར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱའོ་སྙམ་མོ། །
en: I will pass into parinirvāṇa before him.’

source: དེ་ནས་མྱ་ངན་མེད་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དེའི་འོག་ཏུ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: And after Aśoka had passed into parinirvāṇa, the totally and completely awakened Kāśyapa too passed into parinirvāṇa.

source: དེ་ནས་ལྷ་དེས་བསམས་པ་འདིས་ཁྱད་པར་འདི་ལྟ་བུ་ཐོབ་པ་ཅི་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ནི་བདག་གི་མཐུ་ཡིན་ནོ་སྙམ་ནས།
en: “The god thought, ‘Anything of significance he achieved was on account of my powers,’ and he prayed,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘By this root of virtue, may I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་
en: May I go forth in his doctrine alone,

source: བདག་དེ་བས་སྔར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་གྱུར་ལ། དེའི་འོག་ཏུ་སྟོན་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་བོ། །
en: and may my teacher pass into parinirvāṇa only after I pass into parinirvāṇa before him.’

source: དེའི་ཚེ་ལྷར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་རབ་བཟང་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was the god then is none other than Subhadra.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ལ།
en: Going forth in his doctrine alone may I cast away all afflictive emotions, and manifest arhatship.

source: བདག་སྔར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དེའི་འོག་ཏུ་སྟོན་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་གྱུར་ཅིག་ཅེས་བྱས་པ་དེས་ན།
en: May my teacher pass into parinirvāṇa only after I pass into parinirvāṇa before him.’

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: that he has pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.

source: བདག་སྔར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དེའི་འོག་ཏུ་སྟོན་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་གྱུར་ཅིག་ཅེས་དེས་དེར་སྨོན་ལམ་དེ་ལྟར་བཏབ་པ་དེས་ནི་འདི་སྔར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དེའི་འོག་ཏུ་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ། །
en: “Because he also prayed, ‘May my teacher pass into parinirvāṇa only after I pass into parinirvāṇa before him,’ it is only now, after he has passed into parinirvāṇa, that I too shall pass into parinirvāṇa.

source: དགེ་སློང་དག་གཞན་ཡང་འདས་པའི་དུས་ན་ནགས་ཁྲོད་ཅིག་ན་དྲང་སྲོང་ལྔ་བརྒྱ་ཙམ་གནས་སོ། །
en: “Furthermore, monks, in times gone by, some five hundred sages were living deep in a certain forest.

source: ནགས་ཁྲོད་དེ་ན་ལྷ་ཞིག་ཀྱང་གནས་ཏེ། དེ་དྲང་སྲོང་དེ་དག་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏོ། །
en: In that particular forest there also lived a god who was very fond of the sages.

source: དེའི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཁོར་བ་འཇིག་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: At that time the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Krakucchanda was in the world.

source: དེར་གང་གི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་གིས་འདུ་བ་ཆེན་པོ་བསྟན་པ་དེའི་ཚེ། ལྷ་དེ་ཡང་འདུ་བ་ཆེན་པོ་དེར་འདུས་ཏེ།
en: “At that time the totally and completely awakened Buddha Krakucchanda also happened to be teaching before a great gathering, of which the god was a part.

source: དེས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་ལས་ཆོས་ཐོས་ནས་ནགས་ཁྲོད་དུ་སོང་སྟེ། དེས་དྲང་སྲོང་དེ་དག་གི་མདུན་དུ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་གི་བསྔགས་པ་བརྗོད་དོ། །
en: After hearing the Dharma from the totally and completely awakened Buddha Krakucchanda, he went to live deep in the forest, where he spoke the praises of the totally and completely awakened Buddha Krakucchanda to the sages.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་དྲང་སྲོང་དེ་དག་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་མཐོང་འདོད་ཆེས་པའི་སེམས་སྐྱེས་ནས་
en: As soon as they heard him, the sages were eager to see the totally and completely awakened Buddha Krakucchanda,

source: དེ་དག་གིས་ལྷ་དེ་ཉིད་ཀྱི་མདུན་དུ་བདར་ཏེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་ག་ལ་བ་དེར་དོང་སྟེ།
en: and they prayed fervently to the god, until they were able to travel to where the totally and completely awakened Buddha Krakucchanda was.

source: དྲང་སྲོང་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་ཐག་རིང་པོ་ཞིག་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་ཅིང་སྤ་བར་བྱས་པ། མེ་ལུས་ཀྱི་དབྱིབས་སུ་འདུག་པ་ལྟ་བུ། མེ་ལྕེ་མར་གྱིས་བཏབ་པ་ལྟ་བུ། མར་མེ་གསེར་གྱི་སྣོད་དུ་བཞག་པ་ལྟ་བུ། མཆོད་སྡོང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ལྟ་བུ། བློ་གསལ་ཞིང་དྲི་མ་མེད་ལ་རྣམ་པར་དག་པ་དང་ལྡན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: “All five hundred sages saw the totally and completely awakened Buddha Krakucchanda from a distance. His body, graced and resplendent with the thirty-two signs of a great person, looked like it was on fire, like flames stoked with ghee, like a lamp set in a golden vessel, and like a pillar adorned with all manner of jewels. He was immaculate, clear-minded, and pure of heart.

source: དེ་ལྟར་དགའ་བ་སྐྱེས་ནས་ཀྱང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་ག་ལ་བ་དེར་དོང་སྟེ་
en: “Filled with such joy, they went to where the totally and completely awakened Buddha Krakucchanda was,

source: ལྷགས་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་གི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: and upon their arrival they touched their heads to his feet and sat before him to listen to the Dharma.

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་གིས་དེ་རྣམས་ཀྱི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་ཤེས་པ་དང་། རང་བཞིན་ཐུགས་སུ་ཆུད་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ
en: Then the totally and completely awakened Buddha Krakucchanda, directly apprehending their thoughts, habitual tendencies, temperaments, capacities, and natures, taught them the Dharma accordingly.

source: དེས་ན་དྲང་སྲོང་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་སྟན་དེ་དག་ཉིད་ལ་འཁོད་བཞིན་དུ་བདེན་པ་རྟོགས་མ་ཐག་ཏུ་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་སོ། །
en: Hearing it, the five hundred sages realized the truths and immediately manifested the resultant state of non-return right where they sat.

source: དེ་དག་གིས་བདེན་པ་མཐོང་ནས་གསོལ་པ།
en: “After seeing the truths, they requested,

source: བཙུན་པ་བདག་ཅག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་། བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན
en: ‘Lord, if permitted we wish to go forth in the Dharma and Vinaya so well spoken, complete our novitiates, and achieve full ordination.

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་གིས་དྲང་སྲོང་ལྔ་བརྒྱ་པོ་དེ་དག་ལ་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་ཕྱུང་སྟེ་
en: “By speaking the words ‘Come, join me, monks!’ to the five hundred sages, the totally and completely awakened Buddha Krakucchanda led them to go forth as novices,

source: བསྙེན་པར་རྫོགས་པར་མཛད་ནས་དེ་དག་ལ་ལུང་ཡང་ཕོག་སྟེ
en: conferred on them full ordination, and instructed them.

source: དེ་དག་གིས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་། འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Casting away all afflictive emotions through diligence, practice, and effort, they manifested arhatship.

source: དེ་དག་དགྲ་བཅོམ་པ་ཁམས་གསུམ་པའི་འདོད་ཆགས་དང་བྲལ་བར་གྱུར་ནས་གསེར་དང་བོང་བར་མཉམ་པ། ནམ་མཁའ་དང་ལག་མཐིལ་དུ་འདྲ་བའི་སེམས་དང་ལྡན་པ།
en: “As arhats, free from the attachments of the three realms, their minds regarded gold no differently than filth, and the palms of their hands as like space itself.

source: རིག་པས་སྒ་ངའི་སྦུབས་བཅོམ་པ།
en: Their insight crushed ignorance like an eggshell.

source: དབང་པོ་དང་། ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་ཅིང་རྗེད་པ་དང་གུས་པར་སྨྲ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: They became objects of offering, veneration, and respectful address by Indra, Upendra, and the other gods.

source: དེ་ནས་གང་གི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་གིས་སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་ཐམས་ཅད་མཛད་ནས་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བཞེད་དེགཟིམས་མལ་གྱི་ཐ་མར་བཞུགས་པ་
en: “When the totally and completely awakened Krakucchanda had carried out all the activities of a buddha and wished to pass beyond all sorrow in the realm of nirvāṇa without any remainder of the aggregates, he took to his final bed.

source: དེའི་ཚེ་དགེ་སློང་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་བསམས་པ།
en: The five hundred monks thought,

source: བདག་ཅག་གི་སྟོན་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ལྟ་བ་ནི་བདག་ཅག་གི་ཆ་མ་ཡིན་གྱིས་མ་ལ་བདག་ཅག་སྔར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱའོ་སྙམ་ནས་
en: ‘It wouldn’t be right to see our teacher pass into parinirvāṇa. We should pass into parinirvāṇa before him.’

source: དགེ་སློང་ལྔ་བརྒྱ་པོ་དེ་དག་སྔར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེདེའི་འོག་ཏུ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: And after all five hundred monks passed into parinirvāṇa, the totally and completely awakened Buddha Krakucchanda too passed into parinirvāṇa.

source: དེ་ནས་ལྷ་དེས་སྨོན་ལམ་བཏབ་པ།
en: “The god prayed,

source: འདི་རྣམས་ཀྱི་ཡོན་ཏན་གྱི་ཚོགས་འདི་ལྟ་བུ་ཐོབ་པ་ཅི་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ནི་བདག་གི་མཐུ་ཡིན་གྱིས།
en: ‘Whatever great virtues they achieved were on account of my powers,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན་བདག་གིས་ཀྱང་སྟོན་པ་འདི་ལྟ་བུ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག་མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: so by this root of virtue, may I please and not displease a teacher just like this one.

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ལ།
en: and manifest arhatship,

source: བདག་ཀྱང་སྟོན་པ་དེ་གཟིམས་མལ་གྱི་ཐ་མར་བཞུགས་པའི་སྔ་རོལ་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: and may my teacher pass into parinirvāṇa only after I have passed into parinirvāṇa.’

source: དེས་དེར་སྨོན་ལམ་བཏབ་པ་དེས་ན་དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་དང་ཤིན་ཏུ་མཉམ་པ་དང་། ཤུགས་མཉམ་པ་དང་། མཛད་པ་མཉམ་པ་དང་། ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས་
en: Monks, because of his prayers, and now that I myself have become the very equal of the totally and completely awakened Buddha Krakucchanda—equal in strength, equal in deeds, and equal in skillful means—

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ་
en: he has pleased me, not displeased me,

source: མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་
en: gone forth in my very doctrine,

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས་
en: and manifested arhatship.

source: ང་གཟིམས་མལ་གྱི་ཐ་མར་ཞུགས་པ་ན། འདི་སྔར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེ་དེའི་འོག་ཏུ་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ། །
en: And it is only now, after he has passed into parinirvāṇa, that I too shall pass into parinirvāṇa.”
